SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-61777-J

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( FDB_K2_61777.s )
Size  ( 2.718m 3.79m 10.1m )
Mass ( 64.4t-uk )
WheelRadius ( 19in )comment (Front Bogie)

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Comment(Stiffness ( 1e7N/m 1e7N/m ))
			Comment(Damping ( 0.2e7N/m 0.2e7N/m ))
			Break ( 710kN 1220kN )
			r0 ( 0cm 0cm )
		)
		CouplingHasRigidConnection (1)
		Comment(Velocity (0.1m/s))
		Comment(CouplingUniqueType (DR_BR_8P_71000))
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Comment(Stiffness ( 1e6N/m 2e6N/m ))
			Comment(Damping ( 1e6N/m 1e6N/m ))
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	CouplingHasRigidConnection (0)
	Comment(Velocity (-0.1m/s))
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 176kN )   Comment (* braked at 70% of mass on driving wheels 65.5t, coefficient of friction 0.5 *)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)
MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )
MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.9m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 13.0ft 6.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

Comment( CN 1990 DWx18)
ORTSDavis_A ( 5859 )
ORTSDavis_B ( 21.53 )
ORTSDavis_C ( 5.289 )

ORTSWagonFrontalArea (99)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 4
Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( -0.55 3.25 -4.15 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.5 )
     )
    )
   )
Light	(
   comment( Glowing Firebox )
   Type		( 0 )
   Conditions	(
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn	( 0.5 )
   FadeOut	( 0.5 )
   Cycle	( 0 )
   States	(	2
   State	(
   Duration ( 0.5 )
   LightColour ( eeff8800 )
   Position ( 0 2.15 -4.25 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.0 )
   )
   State	(
   Duration ( 0.3 )
   LightColour ( ffff8855 )
   Position ( 0 2.15 -4.25 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.05 )
	  )
      )
   )
Light (
   comment( Head light Position B )
    Type  ( 0 )
    Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.1 )
    LightColour ( ccdddddd )
    Position ( 0.995 1.425 4.76 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
    )
    State (
    Duration ( 0.01 )
    LightColour ( eeffffff )
    Position ( 0.995 1.425 4.76 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
      )
    )
   )
xLight (
   comment( Head light Position A )
    Type  ( 0 )
    Conditions (
    Headlight ( 4 )
    Unit ( 2 )
    )
    FadeIn ( 0.05 )
    FadeOut ( 0.05 )
    Cycle  ( 0 )
    States ( 2
    State (
    Duration ( 0.1 )
    LightColour ( ccdddddd )
    Position ( 0 3.45 3.92 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
    )
    State (
    Duration ( 0.1 )
    LightColour ( eeffffff )
    Position ( 0 3.45 3.92 )
    Azimuth ( 0 0 0 )
    Transition ( 0 )
    Radius ( 0.6 )
      )
    )
   )
 )
	
Comment( ******* Miscellaneous Wagon Information************ )


Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( FDB_K2_61777.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.7 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)

Engine ( OR-61777-J

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
			-0.3 3.80 -3.3
				0 1 0
				0.11
			)
			SafetyValvesFX
			(
			0 3.8 -2.75
				0 1 0
				0.28
			)
			StackFX
			(
			0 3.75 3.20
				0 1 0
				0.3
			)
			StackFX
			(
			0 3.80 3.20
				0 1 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)
			
			Injectors2FX
			(
				-1.1 1.1 -4.9
				0 -1 0
				0.15
			)
			Injectors1FX
			(
				1.1 1.1 -4.9
				0 -1 0
				0.11
			)
      		Comment ( == Cylinder - Right == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				-1.083 0.6 3.1
				0 -0.577 1
				0.13
			)
      		Comment ( == Cylinder - Right == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				-1.083 0.6 2.4
				0 -0.577 1
				0.13
			)
      		Comment ( == Cylinder - Left == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				1.083 0.6 3.1
				0 -0.577 1
				0.13
			)
      		Comment ( == Cylinder - Left == )
			Comment( Cylinder Cock Pipe Angle )
			Comment( 30 deg DOWN -y/z )
			Comment( tan30 = 0.577 )
			CylindersFX
			(
				1.083 0.6 2.4
				0 -0.577 1
				0.13
			)
		)
	)

Wagon ( OR-61777-J )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 34in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 56.4t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 256ft^3 )  
ORTSEvaporationArea ( 1934.5ft^2 )
ORTSSuperheatArea ( 305ft^2 )
MaxBoilerPressure ( 180psi )
MaxSteamHeatingPressure ( 50psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 20in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 24ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 6.5t-uk )
MaxTenderWaterMass ( 35000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

Comment(ORTSMaxIndicatedHorsepower ( 1358.0hp ))   

Comment(ORTSMaxSuperheatTemperature ( 158.0 ))   

Comment(ORTSSuperheatCutoffPressureFactor ( 35.0 ))   Comment(Set to acheive correct steam and fuel rates - but no longer used from Jan 2022)

ORTSBoilerEfficiency( 0.0 0.92  170.0 0.46 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
          Notch(0    0 TrainBrakesControllerReleaseStart )
          Notch(0.1  0 TrainBrakesControllerRunningStart )
          Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector( 0 1 0.1 0.55 )

FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( K3.cvf )
HeadOut (  -1.423 3.0 -3.7 )
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "61777 K2, Mineral Goods, TE 23.4Klbf" )
Description (
"A total of 65 K2s would be built in a total of 5 batches between 1914 and 1921. The first two batches were built at Doncaster, with two later batches built by the North British Locomotive Co, and the last batch being built by Kitson & Co. Initial allocations joined their K1 brothers at Kings Cross, Colwick, and Doncaster; although they quickly displaced the Kings Cross K1s. Later K2s would also be distributed to Peterborough.\n"+
"\n"+
"Other than the rebuilding of the K1s as K2s, the only significant changes made by the LNER were to all these GNR locomotives to run on the restrictive loading gauges of the Great Eastern (GER) and North British (NBR) lines. The K1s were quickly fitted with short chimneys in 1923 enabling them to work on GER lines. Drawings were prepared to convert the K2s, and these started to appear on GER and NBR lines as they were displaced by new K3s from 1924. The modifications consisted of a shorter chimney and dome cover, lowering of the cab roof, moving the whistles, and replacement of Ramsbottom safety valves with Ross pop valves. From 1924-25, the K2s would become regular workers on the West Highland line and in East Anglia: a sharp contrast of hilly terrain and flat agricultural land.\n"+
"\n"+
"Between 1927 and 1928, twenty K2s had Westinghouse pumps fitted so that they could work passenger services from Liverpool Street on the Colchester and Cambridge lines.\n"+
"\n"+
"The K2 cabs were not very popular with the Scottish crews, so between 1932 and 1935, the Scottish K2s had side window cabs fitted. When further K2s were transferred to Scotland, they would similarly have their cabs rebuilt.\n"+
"\n"+
"All 75 K2s survived into British Railways ownership. At this point, 31 were allocated to the western section of the Southern Area, 23 to the Eastern Area, and 21 to the Scottish Area."
)
)
